// ---------------------------------------------------------------------
// 题目描述:
// 2N个学生两两结对子, 每个学生都只想和自己的朋友结对子.
// 给定学生之间的朋友关系, 求最多能结多少对对子.
// ---------------------------------------------------------------------
// 思路:
// 学生当作顶点, 朋友关系当作边.
// 一般图匹配可以使用Edmonds等算法, 但是实现较为复杂.
// 可以尝试利用Tutte矩阵来计算一般图最大匹配的匹配数.
// 对于无向图G=(V,E)的每一条边随意赋予方向得到有向图G'=(V,E'),
// 并对每条边e∈E'都关联一个变量xe, 得到如下定义的V*V的Tutte矩阵:
//          | x(u,v),       (u,v)∈E'
// t(u,v) = |-x(v,u),       (v,u)∈E'
//          | 0             其他
// 有以下结论:
// 1. G没有完美匹配 <=> 行列式det(T)=0
// 2. 最大匹配的顶点数 = T的秩
// ---------------------------------------------------------------------